declare namespace NodeJS {
  interface ProcessEnv {
    // ======================================
    // ОСНОВНЫЕ НАСТРОЙКИ ОКРУЖЕНИЯ
    // ======================================
    NODE_ENV: 'development' | 'production' | 'test';

    // ======================================
    // НАСТРОЙКИ СЕРВЕРА
    // ======================================
    HOSTNAME?: string;
    PORT?: string;

    // ======================================
    // НАСТРОЙКИ API
    // ======================================
    NEXT_PUBLIC_API_URL: string;
    NEXT_PUBLIC_DOMAIN: string;

    // ======================================
    // НАСТРОЙКИ АВТОРИЗАЦИИ
    // ======================================
    AUTH_COOKIE_NAME: string;

    // ======================================
    // НАСТРОЙКИ WebSocket
    // ======================================
    NEXT_PUBLIC_WS_BASE_URL: string;

    // ======================================
    NEXT_PUBLIC_USE_FISCAL: string;
  }
}
